Revit 2024 API
ExternalServiceOptions.IsRecordable Property
 Indicates whether executions of the service is recorded in documents or not.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsRecordable { get; set; }
Visual Basic
Public Property IsRecordable As Boolean
	Get
	Set
Visual C++
public:
property bool IsRecordable {
	bool get ();
	void set (bool value);
}
Remarks
When a recordable service is executed in a document, a record about the executed server (or servers) is stored in the document's history. This allows active servers to be synchronized next time a saved document is opened in Revit.
Executions of a recordable service in a document must happen inside a transaction.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: A service that doens't support activation should not be recordable.
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace